valentyn-zaitsev/Submarine_stm32f411/Core/Src/nrf24l01.c
/*
Library:					NRF24L01/NRF24L01+
Written by:				Mohamed Yaqoob (MYaqoobEmbedded YouTube Channel)
Date Written:			10/11/2018
Last modified:		-/-
Description:			This is an STM32 device driver library for the NRF24L01 Nordic Radio transceiver, using STM HAL libraries

References:				This library was written based on the Arduino NRF24 Open-Source library by J. Coliz and the NRF24 datasheet
										- https://github.com/maniacbug/RF24
										- https://www.sparkfun.com/datasheets/Components/SMD/nRF24L01Pluss_Preliminary_Product_Specification_v1_0.pdf

* Copyright (C) 2018 - M. Yaqoob
   This is a free software under the GNU license, you can redistribute it and/or modify it under the terms
   of the GNU General Public Licenseversion 3 as published by the Free Software Foundation.

   This software library is shared with puplic for educational purposes, without WARRANTY and Author is not liable for any damages caused directly
   or indirectly by this software, read more about this on the GNU General Public License.
*/

#include "nrf24.h"

#define DWT_CONTROL *(volatile unsigned long *)0xE0001000
#define SCB_DEMCR   *(volatile unsigned long *)0xE000EDFC

#define HIGH 1
#define LOW  0
#define DEBUG_UART	1

SPI_HandleTypeDef *nrf_spi;
UART_HandleTypeDef *debug_uart;

bool p_variant; /** False for RF24L01 and true for RF24L01P */
uint8_t payload_size = 0; /**< Fixed size of payloads */
bool dynamic_payloads_enabled; /**< Whether dynamic payloads are enabled. */
uint8_t pipe0_reading_address[5] = {0,}; /**< Last address set on pipe 0 for reading. */
uint8_t addr_width = 0; /**< The address width to use - 3,4 or 5 bytes. */
uint8_t txDelay = 0;


static void DWT_Init(void)
{
    SCB_DEMCR |= CoreDebug_DEMCR_TRCENA_Msk; // разрешаем использовать счётчик
	DWT_CONTROL |= DWT_CTRL_CYCCNTENA_Msk;   // запускаем счётчик
}

static void delay_us(uint32_t us)
{
    uint32_t us_count_tic =  us * (SystemCoreClock / 1000000);
    DWT->CYCCNT = 0U; // обнуляем счётчик
    while(DWT->CYCCNT < us_count_tic);
}

#define nrf_csn(level) {HAL_GPIO_WritePin(NRF_CSN_GPIO_Port, NRF_CSN_Pin, (GPIO_PinState)level); delay_us(5);}

#define nrf_ce(level) HAL_GPIO_WritePin(NRF_CE_GPIO_Port, NRF_CE_Pin, (GPIO_PinState)level);

static uint8_t nrf_read_register(uint8_t reg)
{
	uint8_t addr = R_REGISTER | (REGISTER_MASK & reg);
	uint8_t dt = 0;

	nrf_csn(LOW);
	HAL_SPI_TransmitReceive(nrf_spi, &addr, &dt, 1, 1000);
	HAL_SPI_TransmitReceive(nrf_spi, (uint8_t*)0xff, &dt, 1, 1000);
	nrf_csn(HIGH);
	return dt;
}

static uint8_t nrf_write_registerMy(uint8_t reg, const uint8_t* buf, uint8_t len)
{
	uint8_t status = 0;
	uint8_t addr = W_REGISTER | (REGISTER_MASK & reg);

	nrf_csn(LOW);
	HAL_SPI_TransmitReceive(nrf_spi, &addr, &status, 1, 100);
	HAL_SPI_Transmit(nrf_spi, (uint8_t*)buf, len, 100);
	nrf_csn(HIGH);
	return status;
}

static uint8_t nrf_write_register(uint8_t reg, uint8_t value)
{
	uint8_t status = 0;
	uint8_t addr = W_REGISTER | (REGISTER_MASK & reg);
	nrf_csn(LOW);
	HAL_SPI_TransmitReceive(nrf_spi, &addr, &status, 1, 100);
	HAL_SPI_Transmit(nrf_spi, &value, 1, 1000);
	nrf_csn(HIGH);
	return status;
}

uint8_t nrf_write_payload(const void* buf, uint8_t data_len, const uint8_t writeType)
{
	uint8_t status = 0;
	const uint8_t* current = (const uint8_t*)buf;
	uint8_t addr = writeType;

	data_len = rf24_min(data_len, payload_size);
	uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

	nrf_csn(LOW);
	HAL_SPI_TransmitReceive(nrf_spi, &addr, &status, 1, 100);
	HAL_SPI_Transmit(nrf_spi, (uint8_t*)current, data_len, 100);

	while(blank_len--)
	{
		uint8_t empt = 0;
		HAL_SPI_Transmit(nrf_spi, &empt, 1, 100);
	}

	nrf_csn(HIGH);
	return status;
}

uint8_t nrf_read_payload(void* buf, uint8_t data_len)
{
	uint8_t status = 0;
	uint8_t* current = (uint8_t*)buf;

	if(data_len > payload_size)
	{
		data_len = payload_size;
	}

	uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

	uint8_t addr = R_RX_PAYLOAD;
	nrf_csn(LOW);
	HAL_SPI_Transmit(nrf_spi, &addr, 1, 100);
	HAL_SPI_Receive(nrf_spi, (uint8_t*)current, data_len, 100);

	while(blank_len--)
	{
		uint8_t empt = 0;
		HAL_SPI_Receive(nrf_spi, &empt, 1, 100);
	}

	nrf_csn(HIGH);
	return status;
}

uint8_t nrf_flush_rx(void)
{
	return nrf_spiTrans(FLUSH_RX);
}

uint8_t nrf_flush_tx(void)
{
	return nrf_spiTrans(FLUSH_TX);
}

uint8_t nrf_spiTrans(uint8_t cmd)
{
	uint8_t status = 0;
	nrf_csn(LOW);
	HAL_SPI_TransmitReceive(nrf_spi, &cmd, &status, 1, 1000);
	nrf_csn(HIGH);
	return status;
}

uint8_t nrf_get_status(void)
{
	return nrf_spiTrans(NOP);
}

void nrf_setChannel(uint8_t channel)
{
	nrf_write_register(RF_CH, channel);
}

uint8_t nrf_getChannel(void)
{
	return nrf_read_register(RF_CH);
}

void nrf_setPayloadSize(uint8_t size)
{
	payload_size = rf24_min(size, 32);
}

uint8_t nrf_getPayloadSize(void)
{
	return payload_size;
}

nrf_state nrf_init(SPI_HandleTypeDef *spi, rf24_pa_dbm_e level, rf24_datarate_e datarate, uint8_t channel, UART_HandleTypeDef *uart)
{
	nrf_spi = spi;
	debug_uart = uart;

	DWT_Init();

	char str[64] = {0};
	uint8_t res;

	if (res == nrf_isChipConnected()){
		//return NRF_INIT_ERROR;
	}

	uint8_t setup = 0;
	p_variant = false;
	payload_size = 32;
	dynamic_payloads_enabled = false;
	addr_width = 5;
	pipe0_reading_address[0] = 0;

	nrf_ce(LOW);
	nrf_csn(HIGH);
	HAL_Delay(5);

	nrf_write_register(NRF_CONFIG, 0x0C); // Reset NRF_CONFIG and enable 16-bit CRC.
	nrf_setRetries(5, 15);
	nrf_setPALevel(level); // Reset value is MAX

	if(nrf_setDataRate(RF24_250KBPS)) // check for connected module and if this is a p nRF24l01 variant
	{
		p_variant = true;
	}

	setup = nrf_read_register(RF_SETUP);
	nrf_setDataRate(datarate); // Then set the data rate to the slowest (and most reliable) speed supported by all hardware.

	// Disable dynamic payloads, to match dynamic_payloads_enabled setting - Reset value is 0
	nrf_toggle_features();
	nrf_write_register(FEATURE, 0);
	nrf_write_register(DYNPD, 0);
	dynamic_payloads_enabled = false;

	// Reset current status. Notice reset and flush is the last thing we do
	nrf_write_register(NRF_STATUS, (1 << RX_DR) | (1 << TX_DS) | (1 << MAX_RT));
	nrf_setChannel(channel);
	nrf_flush_rx();
	nrf_flush_tx();
	nrf_powerUp(); //Power up by default when begin() is called
	nrf_write_register(NRF_CONFIG, (nrf_read_register(NRF_CONFIG)) & ~(1 << PRIM_RX));

	if (setup != 0 && setup != 0xff){

	} else {
		return NRF_INIT_ERROR;
	}

	nrf_enableAckPayload();
	//setAutoAck(false);
	//setPayloadSize(3);
//	nrf_setChannel(channel);

#ifdef DEBUG_UART
	uint8_t status = nrf_get_status();
	snprintf(str, 64, "get_status: 0x%02x\n", status);
	HAL_UART_Transmit(debug_uart, (uint8_t*)str, strlen(str), 1000);

