valentyn-zaitsev/Submarine_stm32f411/Core/Src/nrf24l01.c
	status = nrf_getPALevel();
	snprintf(str, 64, "getPALevel: 0x%02x  ", status);
	HAL_UART_Transmit(debug_uart, (uint8_t*)str, strlen(str), 1000);

	if(status == 0x00)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_PA_MIN\n", strlen("RF24_PA_MIN\n"), 1000);
	}
	else if(status == 0x01)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_PA_LOW\n", strlen("RF24_PA_LOW\n"), 1000);
	}
	else if(status == 0x02)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_PA_HIGH\n", strlen("RF24_PA_HIGH\n"), 1000);
	}
	else if(status == 0x03)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_PA_MAX\n", strlen("RF24_PA_MAX\n"), 1000);
	}

	status = nrf_getChannel();
	snprintf(str, 64, "getChannel: 0x%02x № %d\n", status, status);
	HAL_UART_Transmit(debug_uart, (uint8_t*)str, strlen(str), 1000);

	status = nrf_getDataRate();
	snprintf(str, 64, "getDataRate: 0x%02x  ", status);
	HAL_UART_Transmit(debug_uart, (uint8_t*)str, strlen(str), 1000);

	if(status == 0x02)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_250KBPS\n", strlen("RF24_250KBPS\n"), 1000);
	}
	else if(status == 0x01)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_2MBPS\n", strlen("RF24_2MBPS\n"), 1000);
	}
	else
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_1MBPS\n", strlen("RF24_1MBPS\n"), 1000);
	}

	status = nrf_getPayloadSize();
	snprintf(str, 64, "getPayloadSize: %d\n", status);
	HAL_UART_Transmit(debug_uart, (uint8_t*)str, strlen(str), 1000);

	status = nrf_getCRCLength();
	snprintf(str, 64, "getCRCLength: 0x%02x  ", status);
	HAL_UART_Transmit(debug_uart, (uint8_t*)str, strlen(str), 1000);

	if(status == 0x00)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_CRC_DISABLED\n", strlen("RF24_CRC_DISABLED\n"), 1000);
	}
	else if(status == 0x01)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_CRC_8\n", strlen("RF24_CRC_8\n"), 1000);
	}
	else if(status == 0x02)
	{
	  HAL_UART_Transmit(debug_uart, (uint8_t*)"RF24_CRC_16\n", strlen("RF24_CRC_16\n"), 1000);
	}
#endif
	nrf_maskIRQ(false, false, true);

	return NRF_OK;
}

bool nrf_isChipConnected(void)
{
	uint8_t setup = nrf_read_register(SETUP_AW);

	if(setup >= 1 && setup <= 3)
	{
		return true;
	}

	return false;
}

void nrf_startListening(void)
{
	nrf_powerUp();

	nrf_write_register(NRF_CONFIG, nrf_read_register(NRF_CONFIG) | (1 << PRIM_RX));
	nrf_write_register(NRF_STATUS, (1 << RX_DR) | (1 << TX_DS) | (1 << MAX_RT));
	nrf_ce(HIGH);
	// Restore the pipe0 adddress, if exists
	if(pipe0_reading_address[0] > 0)
	{
		nrf_write_registerMy(RX_ADDR_P0, pipe0_reading_address, addr_width);
	}
	else
	{
		nrf_closeReadingPipe(0);
	}

	if(nrf_read_register(FEATURE) & (1 << EN_ACK_PAY))
	{
		nrf_flush_tx();
	}
}


static const uint8_t child_pipe_enable[] = {ERX_P0, ERX_P1, ERX_P2, ERX_P3, ERX_P4, ERX_P5};

void nrf_stopListening(void)
{
	nrf_ce(LOW);
	delay_us(txDelay);

	if(nrf_read_register(FEATURE) & (1 << EN_ACK_PAY))
	{
		delay_us(txDelay); //200
		nrf_flush_tx();
	}

	nrf_write_register(NRF_CONFIG, (nrf_read_register(NRF_CONFIG)) & ~(1 << PRIM_RX));
	nrf_write_register(EN_RXADDR, nrf_read_register(EN_RXADDR) | (1 << child_pipe_enable[0])); // Enable RX on pipe0
}

void nrf_powerDown(void)
{
	nrf_ce(LOW); // Guarantee CE is low on powerDown
	nrf_write_register(NRF_CONFIG, nrf_read_register(NRF_CONFIG) & ~(1 << PWR_UP));
}

//Power up now. Radio will not power down unless instructed by MCU for config changes etc.
void nrf_powerUp(void)
{
	uint8_t cfg = nrf_read_register(NRF_CONFIG);
	// if not powered up then power up and wait for the radio to initialize
	if(!(cfg & (1 << PWR_UP)))
	{
		nrf_write_register(NRF_CONFIG, cfg | (1 << PWR_UP));
		HAL_Delay(5);
	}
}


//Similar to the previous write, clears the interrupt flags
bool nrf_write(const void* buf, uint8_t len)
{
	nrf_startFastWrite(buf, len, 1, 1);

	while(!(nrf_get_status() & ((1 << TX_DS) | (1 << MAX_RT))))
	{}

	nrf_ce(LOW);
	uint8_t status = nrf_write_register(NRF_STATUS, (1 << RX_DR) | (1 << TX_DS) | (1 << MAX_RT));

	if(status & (1 << MAX_RT))
	{
		nrf_flush_tx(); //Only going to be 1 packet int the FIFO at a time using this method, so just flush
		return 0;
	}

	//TX OK 1 or 0
	return 1;
}

void nrf_startFastWrite(const void* buf, uint8_t len, const bool multicast, bool startTx)
{
	nrf_write_payload(buf, len, multicast ? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD);

	if(startTx)
	{
		nrf_ce(HIGH);
	}
}

void nrf_maskIRQ(bool tx, bool fail, bool rx)
{
	uint8_t config = nrf_read_register(NRF_CONFIG);
	config &= ~(1 << MASK_MAX_RT | 1 << MASK_TX_DS | 1 << MASK_RX_DR); //clear the interrupt flags
	config |= fail << MASK_MAX_RT | tx << MASK_TX_DS | rx << MASK_RX_DR; // set the specified interrupt flags
	nrf_write_register(NRF_CONFIG, config);
}

uint8_t nrf_getDynamicPayloadSize(void)
{
	uint8_t result = 0, addr;
	nrf_csn(LOW);
	addr = R_RX_PL_WID;
	HAL_SPI_TransmitReceive(nrf_spi, &addr, &result, 1, 1000);
	HAL_SPI_TransmitReceive(nrf_spi, (uint8_t*)0xff, &result, 1, 1000);
	nrf_csn(HIGH);

	if(result > 32)
	{
		nrf_flush_rx();
		HAL_Delay(2);
		return 0;
	}

	return result;
}

bool nrf_availableMy(void)
{
	return nrf_available(NULL);
}

bool nrf_available(uint8_t* pipe_num)
{
	if(!(nrf_read_register(FIFO_STATUS) & (1 << RX_EMPTY)))
	{
		if(pipe_num) // If the caller wants the pipe number, include that
		{
			uint8_t status = nrf_get_status();
			*pipe_num = (status >> RX_P_NO) & 0x07;
		}

		return 1;
	}

	return 0;
}

void nrf_read(void* buf, uint8_t len)
{
	nrf_read_payload(buf, len);
	nrf_write_register(NRF_STATUS, (1 << RX_DR) | (1 << MAX_RT) | (1 << TX_DS));
}


uint8_t nrf_whatHappened()
{
	uint8_t status = nrf_write_register(NRF_STATUS, (1 << RX_DR) | (1 << TX_DS) | (1 << MAX_RT));
	/*uint8_t tx_ok = status & (1 << TX_DS);
	uint8_t tx_fail = status & (1 << MAX_RT);
	uint8_t rx_ready = status & (1 << RX_DR);*/
	return status;
}

void nrf_openWritingPipe(uint64_t value)
{
	nrf_write_registerMy(RX_ADDR_P0, (uint8_t*)&value, addr_width);
	nrf_write_registerMy(TX_ADDR, (uint8_t*)&value, addr_width);
	nrf_write_register(RX_PW_P0, payload_size);
}


static const uint8_t child_pipe[] = {RX_ADDR_P0, RX_ADDR_P1, RX_ADDR_P2, RX_ADDR_P3, RX_ADDR_P4, RX_ADDR_P5};

static const uint8_t child_payload_size[] = {RX_PW_P0, RX_PW_P1, RX_PW_P2, RX_PW_P3, RX_PW_P4, RX_PW_P5};


void nrf_openReadingPipe(uint8_t child, uint64_t address)
{
	if(child == 0)
	{
		memcpy(pipe0_reading_address, &address, addr_width);
	}

	if(child <= 6)
	{
		// For pipes 2-5, only write the LSB
		if(child < 2)
			nrf_write_registerMy(child_pipe[child], (const uint8_t*)&address, addr_width);
		else
			nrf_write_registerMy(child_pipe[child], (const uint8_t*)&address, 1);

		nrf_write_register(child_payload_size[child], payload_size);
		nrf_write_register(EN_RXADDR, nrf_read_register(EN_RXADDR) | (1 << child_pipe_enable[child]));
	}
}

void nrf_setAddressWidth(uint8_t a_width)
{
	if(a_width -= 2)
	{
		nrf_write_register(SETUP_AW, a_width%4);
		addr_width = (a_width%4) + 2;
	}
	else
	{
		nrf_write_register(SETUP_AW, 0);
        addr_width = 2;
    }
}

void nrf_closeReadingPipe(uint8_t pipe)
{
	nrf_write_register(EN_RXADDR, nrf_read_register(EN_RXADDR) & ~(1 << child_pipe_enable[pipe]));
}

void nrf_toggle_features(void)
{
	uint8_t addr = ACTIVATE;
	nrf_csn(LOW);
	HAL_SPI_Transmit(nrf_spi, &addr, 1, 1000);
	HAL_SPI_Transmit(nrf_spi, (uint8_t*)0x73, 1, 1000);
	nrf_csn(HIGH);
}

void nrf_enableDynamicPayloads(void)
{
	nrf_write_register(FEATURE, nrf_read_register(FEATURE) | (1 << EN_DPL));
	nrf_write_register(DYNPD, nrf_read_register(DYNPD) | (1 << DPL_P5) | (1 << DPL_P4) | (1 << DPL_P3) | (1 << DPL_P2) | (1 << DPL_P1) | (1 << DPL_P0));
	dynamic_payloads_enabled = true;
}

void nrf_disableDynamicPayloads(void)
{
	nrf_write_register(FEATURE, 0);
	nrf_write_register(DYNPD, 0);
	dynamic_payloads_enabled = false;
}

